In [22]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [23]:
df = pd.read_csv(r"C:\Users\sahil\OneDrive\Naresh IT Class\Data Files\housing_price_dataset.csv")

In [24]:
df.head()

   SquareFeet  Bedrooms  Bathrooms Neighborhood  YearBuilt          Price
0        2126         4          1        Rural       1969  215355.283618
1        2459         3          2        Rural       1980  195014.221626
2        1860         2          1       Suburb       1970  306891.012076
3        2294         2          1        Urban       1996  206786.787153
4        2130         5          2       Suburb       2001  272436.239065

In [25]:
df.shape

(50000, 6)

In [26]:
df.columns

Index(['SquareFeet', 'Bedrooms', 'Bathrooms', 'Neighborhood', 'YearBuilt',
       'Price'],
      dtype='object')

In [27]:
df.isnull().sum()

SquareFeet      0
Bedrooms        0
Bathrooms       0
Neighborhood    0
YearBuilt       0
Price           0
dtype: int64

In [28]:
df.dtypes

SquareFeet        int64
Bedrooms          int64
Bathrooms         int64
Neighborhood     object
YearBuilt         int64
Price           float64
dtype: object

In [29]:
house_age = []
for i in df['YearBuilt']:
    house_age.append(2024-i)

In [30]:
df['House_age'] = house_age

In [31]:
df.head()

,SquareFeet,Bedrooms,Bathrooms,Neighborhood,YearBuilt,Price,House_age
0,2126,4,1,Rural,1969,215355.283618,55
1,2459,3,2,Rural,1980,195014.221626,44
2,1860,2,1,Suburb,1970,306891.012076,54
3,2294,2,1,Urban,1996,206786.787153,28
4,2130,5,2,Suburb,2001,272436.239065,23

In [32]:
df.tail()

,SquareFeet,Bedrooms,Bathrooms,Neighborhood,YearBuilt,Price,House_age
49995,1282,5,3,Rural,1975,100080.865895,49
49996,2854,2,2,Suburb,1988,374507.656727,36
49997,2979,5,3,Suburb,1962,384110.555590,62
49998,2596,5,2,Rural,1984,380512.685957,40
49999,1572,5,3,Rural,2011,221618.583218,13

In [33]:

df['Price1'] = df['Price']

In [34]:
df.drop('Price',inplace=True, axis=1)

In [35]:
df.rename(columns={'Price1':'Price'},inplace=True)

In [36]:
df.drop('YearBuilt', axis=1, inplace=True)

In [37]:
df.head()

   SquareFeet  Bedrooms  Bathrooms Neighborhood  House_age          Price
0        2126         4          1        Rural         55  215355.283618
1        2459         3          2        Rural         44  195014.221626
2        1860         2          1       Suburb         54  306891.012076
3        2294         2          1        Urban         28  206786.787153
4        2130         5          2       Suburb         23  272436.239065

In [39]:
df['Neighborhood'].value_counts()

Neighborhood
Suburb    16721
Rural     16676
Urban     16603
Name: count, dtype: int64

#### Applying One Hot Encoding